In [20]:
import pandas as pd

In [21]:
power = [234, 563,754,346]
df = pd.DataFrame(power, columns= ['Power_Generated'])

In [19]:
df

   Power
0    234
1    563
2    754
3    346

In [3]:
import pandas as pd

In [4]:
bill = [310, 230, 440, 234,650]
df = pd.DataFrame(bill, columns= ['bill_Generated'])

In [5]:
df

   bill_Generated
0             310
1             230
2             440
3             234
4             650

In [67]:
df.to_csv('person.csv')

In [77]:
df.to_excel('person.xlsx')

In [6]:
person = {  
    "Name": ['Musa', 'Anas','Anisah','Jafar'],
    "Age" : [17, 18,16,20],
    "Grade": ["A", "B","A", "B"],
   'Height': [4.5, 5.5 , 4.7 , 5.6]
}
person_df = pd.DataFrame(person)

In [7]:
person_df

     Name  Age Grade  Height
0    Musa   17     A     4.5
1    Anas   18     B     5.5
2  Anisah   16     A     4.7
3   Jafar   20     B     5.6

In [8]:
person_df.shape

(4, 4)

In [9]:
student = {'Name': ['Taiy', 'Wasi', 'Amin', 'Basi',],
           'Age': [30, 20, 25,15],
           'Height':[1.3,1.4,1.8,1.9]
 }
student_df =pd.DataFrame(student)

In [10]:
student_df

   Name  Age  Height
0  Taiy   30     1.3
1  Wasi   20     1.4
2  Amin   25     1.8
3  Basi   15     1.9

In [17]:
student_df.shape

(4, 3)

In [19]:
student_df.tail(2)

   Name  Age  Height
2  Amin   25     1.8
3  Basi   15     1.9

In [11]:
student_df.to_csv('person.csv')

In [79]:
student_df.to_excel('person.xlsx')

In [2]:
import pandas as pd

In [3]:
Sat_college = pd.read_csv("./SAT__College_Board__2010_School_Level_Results_20240506.csv")

In [4]:
Sat_college

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
455,75R025,South Richmond High School,10.0,407.0,421.0,400.0
456,75X012,PS12X LEWIS AND CLARK SCHOOL,NaN,NaN,NaN,NaN
457,75X754,P754 X - Jeffrey M. Rapport School for Career ...,NaN,NaN,NaN,NaN
458,76K460,John Jay High School,9.0,390.0,381.0,398.0
459,79X490,PHOENIX SCHOOL,7.0,404.0,423.0,416.0

In [9]:
max(Sat_college)

,DBN,School Name,Number of Test Takers,Critical Reading Mean,Mathematics Mean,Writing Mean
0,01M292,Henry Street School for International Studies,31.0,391.0,425.0,385.0
1,01M448,University Neighborhood High School,60.0,394.0,419.0,387.0
2,01M450,East Side Community High School,69.0,418.0,431.0,402.0
3,01M458,SATELLITE ACADEMY FORSYTH ST,26.0,385.0,370.0,378.0
4,01M509,CMSP HIGH SCHOOL,NaN,NaN,NaN,NaN
5,01M515,Lower East Side Preparatory High School,154.0,314.0,532.0,314.0
6,01M539,"New Explorations into Sci, Tech and Math HS",47.0,568.0,583.0,568.0

In [51]:
study_performance = pd.read_csv("./study_performance.csv")

In [52]:
study_performance

,Gender,Race_ethnicity,Parental_level_of_education,Lunch,Test_preparation_course,Math_score,Reading_score,Writing_score
0,Female,group B,Bachelor'S Degree,standard,none,72,72,74
1,Female,group C,Some College,standard,completed,69,90,88
2,Female,group B,Master'S Degree,standard,none,90,95,93
3,Male,group A,Associate'S Degree,free/reduced,none,47,57,44
4,Male,group C,Some College,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,Female,group E,Master'S Degree,standard,completed,88,99,95
996,Male,group C,High School,free/reduced,none,62,55,55
997,Female,group C,High School,free/reduced,completed,59,71,65
998,Female,group D,Some College,standard,completed,68,78,77
999,Female,group D,Some College,free/reduced,none,77,86,86

In [20]:
person_df.to_csv('person.csv')

In [1]:
person_df.shape

NameError: name 'person_df' is not defined

In [21]:
person_df.to_excel('person.xlsx')